FL0WL0W/EmbeddedIOServices/HardwareAbstractions/ATTiny427Expander/src/ATTiny427ExpanderUpdateService.cpp
#include "ATTiny427ExpanderUpdateService.h"
#include <cstring>

#ifdef ATTINY427EXPANDERUPDATESERVICE_H
namespace EmbeddedIOServices
{
    ATTiny427ExpanderUpdateService::ATTiny427ExpanderUpdateService(ATTiny427Expander_Registers *registers) : _registers(registers)
    {
		_previousRegisters = *_registers; 
    }
    void ATTiny427ExpanderUpdateService::Receive(uint8_t *data, size_t size)
    {
        size_t dataIndex = 0;
        while(dataIndex < size)
        {
            switch(_receiveState)
            {
                default: // waiting on command
                    {
                        const uint8_t cmd = data[dataIndex++];
                        _receiveLength = cmd & 0xF;
                        if(_receiveLength > 0)
                        {
                            if(cmd & 0x40)
                            {
                                if(cmd & 0x20)
                                {
                                    _receiveAddress = 0;
                                }
                                _receiveState = 2;
                            }
                            else
                            {
                                _receiveState = 1;
                            }
                        }
                    }
                    break;
                case 1: // receive High Address
                    _receiveAddress = data[dataIndex++] << 8;
                    _receiveState = 2;
                    break;
                case 2: // receive Low Address
                    _receiveAddress |= data[dataIndex++];
                    _receiveState = 3;
                    _receiveIndex = 0;
                    break;
                case 3: // receive data
                    switch(_receiveAddress)
                    {
                        case 0x1C: //reading AnalogEnable pins and then Analog Values
                            if(_receiveIndex > 3)
                            {
                                if(_receiveIndex % 2 == 0)
                                {
                                    _receiveAnalogValueLowByte = data[dataIndex++];
                                    _receiveIndex++;
                                    while(!(_receiveAnalogEnable & 0x1) && _receiveIndex < 36)
                                    {
                                        _receiveIndex += 2;
                                        _receiveAnalogEnable >>= 1;
                                    }
                                }
                                else
                                {
                                    _registers->AnalogValues[(_receiveIndex - 6)/2] = _receiveAnalogValueLowByte | (data[dataIndex++] << 8);
                                    _receiveAnalogEnable >>= 1;
                                    _receiveIndex++;
                                    if(_receiveAnalogEnable == 0)
                                    {
                                        _receiveState = 0;
                                        _registers->AnalogCounter = _receiveAnalogCounter;
                                    }
                                }
                            }
                            else if(_receiveIndex == 0)
                            {
                                _receiveAnalogEnable = data[dataIndex++];
                                _receiveIndex++;
                            }
                            else if(_receiveIndex == 1)
                            {
                                _receiveAnalogEnable |= data[dataIndex++] << 8;
                                _receiveIndex++;
                            }
                            else if(_receiveIndex == 2)
                            {
                                dataIndex++;
                                _receiveIndex++;
                            }
                            else if(_receiveIndex == 3)
                            {
                                _receiveAnalogCounter = data[dataIndex++];
                                _receiveIndex++;
                            }
                            break;
                        case 0x0A: //reading GPIO
                            switch(_receiveIndex)
                            {
                                case 0:
                                    _registers->PORTC_IN = data[dataIndex++];
                                    break;
                                case 2:
                                    _registers->PORTB_IN = data[dataIndex++];
                                    break;
                                case 4:
                                    _registers->PORTA_IN = data[dataIndex++];
                                    _receiveState = 0;
                                    break;
                                default: 
                                    dataIndex++;
                                    break;
                            }
                            _receiveIndex++;
                            break;
                        case 0x3400: //reading TCB0
                            switch(_receiveIndex)
                            {
                                case 0:
                                    _receiveTcbCounter = data[dataIndex++];
                                    _receiveIndex++;
                                    break;
                                case 1:
                                    _receiveTcbBuffer[0] = data[dataIndex++];
                                    _receiveIndex++;
                                    break;
                                case 2:
                                    _receiveTcbBuffer[1] = data[dataIndex++];
                                    _receiveIndex++;
                                    break;
                                case 3:
                                    _receiveTcbBuffer[2] = data[dataIndex++];
                                    _receiveIndex++;
                                    break;
                                case 4:
                                    _registers->TCB0VALUE[0] = _receiveTcbBuffer[0];
                                    _registers->TCB0VALUE[1] = _receiveTcbBuffer[1];
                                    _registers->TCB0VALUE[2] = _receiveTcbBuffer[2];
                                    _registers->TCB0VALUE[2] = data[dataIndex++];
                                    _receiveIndex = 0;
                                    if(_receiveLength < 6)
                                        _receiveState = 0;
                                    break;
                            }
                        case 0x3405: //reading TCB1
                            switch(_receiveIndex)
                            {
                                case 0:
                                    _receiveTcbCounter = data[dataIndex++];
                                    _receiveIndex++;
                                    break;
                                case 1:
                                    _receiveTcbBuffer[0] = data[dataIndex++];
                                    _receiveIndex++;
                                    break;
                                case 2:
                                    _receiveTcbBuffer[1] = data[dataIndex++];
                                    _receiveIndex++;
                                    break;
                                case 3:
                                    _receiveTcbBuffer[2] = data[dataIndex++];
                                    _receiveIndex++;
                                    break;
                                case 4:
                                    _registers->TCB1VALUE[0] = _receiveTcbBuffer[0];
                                    _registers->TCB1VALUE[1] = _receiveTcbBuffer[1];
                                    _registers->TCB1VALUE[2] = _receiveTcbBuffer[2];
                                    _registers->TCB1VALUE[2] = data[dataIndex++];
                                    _receiveState = 0;
                                    break;
                            }

                        default:
                            if(data[dataIndex++] == 0)
                                _receiveState = 0;
                            break;
                            
