FL0WL0W/EmbeddedIOServices/HardwareAbstractions/ATTiny427Expander/src/ATTiny427ExpanderUpdateService.cpp
                    }
                    break;
            }
        }
    }
    size_t ATTiny427ExpanderUpdateService::Transmit(uint8_t data[1024])
    {
        ATTiny427Expander_Registers transmitRegisters = *_registers;
        //make sure we don't lock ourselves out
        switch(transmitRegisters.Comm)
        {
            case UART0:
                transmitRegisters.PORTB_DIR &= 0b11110011;
                transmitRegisters.PORTB_DIR |= 0b00000100;
                break;
            case UART0Alternate:
            case UART1:
                transmitRegisters.PORTA_DIR &= 0b11111000;
                transmitRegisters.PORTA_DIR |= 0b00000010;
                transmitRegisters.AnalogEnable &= 0xFFF8;
                break;
            case UART1Alternate:
                transmitRegisters.PORTC_DIR &= 0b11110011;
                transmitRegisters.PORTC_DIR |= 0b00000100;
                transmitRegisters.AnalogEnable &= 0xFFCF;
                break;
            case SPI:
                transmitRegisters.PORTA_DIR &= 0b11100000;
                transmitRegisters.PORTA_DIR |= 0b00000100;
                transmitRegisters.AnalogEnable &= 0xFFE0;
                break;
            case SPIAlternate:
                transmitRegisters.PORTC_DIR &= 0b11110000;
                transmitRegisters.PORTC_DIR |= 0b00000010;
                transmitRegisters.AnalogEnable &= 0x0FFE;
                break;
        }

        const bool resetAccumulate = transmitRegisters.AnalogAccumulate != _previousRegisters.AnalogAccumulate || transmitRegisters.AnalogEnable != _previousRegisters.AnalogEnable || _first;
        const bool analogStop = transmitRegisters.AnalogEnable == 0 && (_analogRunning || _first);
        const bool analogStart = transmitRegisters.AnalogEnable != 0 && (!_analogRunning || _first);
        const bool GPIOR0_changed = transmitRegisters.GPIOR0 != _previousRegisters.GPIOR0 || _first;
        const bool GPIOR1_changed = transmitRegisters.GPIOR1 != _previousRegisters.GPIOR1 || _first;
        const bool GPIOR2_changed = transmitRegisters.GPIOR2 != _previousRegisters.GPIOR2 || _first;
        const bool PORTA_PINCTRL_changed =  transmitRegisters.PORTA_PINCTRL[0] != _previousRegisters.PORTA_PINCTRL[0] ||
                                            transmitRegisters.PORTA_PINCTRL[1] != _previousRegisters.PORTA_PINCTRL[1] ||
                                            transmitRegisters.PORTA_PINCTRL[2] != _previousRegisters.PORTA_PINCTRL[2] ||
                                            transmitRegisters.PORTA_PINCTRL[3] != _previousRegisters.PORTA_PINCTRL[3] ||
                                            transmitRegisters.PORTA_PINCTRL[4] != _previousRegisters.PORTA_PINCTRL[4] ||
                                            transmitRegisters.PORTA_PINCTRL[5] != _previousRegisters.PORTA_PINCTRL[5] ||
                                            transmitRegisters.PORTA_PINCTRL[6] != _previousRegisters.PORTA_PINCTRL[6] ||
                                            transmitRegisters.PORTA_PINCTRL[7] != _previousRegisters.PORTA_PINCTRL[7] ||
                                            _first;
        const bool PORTB_PINCTRL_changed =  transmitRegisters.PORTB_PINCTRL[0] != _previousRegisters.PORTB_PINCTRL[0] ||
                                            transmitRegisters.PORTB_PINCTRL[1] != _previousRegisters.PORTB_PINCTRL[1] ||
                                            transmitRegisters.PORTB_PINCTRL[2] != _previousRegisters.PORTB_PINCTRL[2] ||
                                            transmitRegisters.PORTB_PINCTRL[3] != _previousRegisters.PORTB_PINCTRL[3] ||
                                            transmitRegisters.PORTB_PINCTRL[4] != _previousRegisters.PORTB_PINCTRL[4] ||
                                            transmitRegisters.PORTB_PINCTRL[5] != _previousRegisters.PORTB_PINCTRL[5] ||
                                            transmitRegisters.PORTB_PINCTRL[6] != _previousRegisters.PORTB_PINCTRL[6] ||
                                            transmitRegisters.PORTB_PINCTRL[7] != _previousRegisters.PORTB_PINCTRL[7] ||
                                            _first;
        const bool PORTC_PINCTRL_changed =  transmitRegisters.PORTC_PINCTRL[0] != _previousRegisters.PORTC_PINCTRL[0] ||
                                            transmitRegisters.PORTC_PINCTRL[1] != _previousRegisters.PORTC_PINCTRL[1] ||
                                            transmitRegisters.PORTC_PINCTRL[2] != _previousRegisters.PORTC_PINCTRL[2] ||
                                            transmitRegisters.PORTC_PINCTRL[3] != _previousRegisters.PORTC_PINCTRL[3] ||
                                            transmitRegisters.PORTC_PINCTRL[4] != _previousRegisters.PORTC_PINCTRL[4] ||
                                            transmitRegisters.PORTC_PINCTRL[5] != _previousRegisters.PORTC_PINCTRL[5] ||
                                            _first;
        const bool PORTC_OUT_changed = transmitRegisters.PORTC_OUT != _previousRegisters.PORTC_OUT || _first;
        const bool PORTB_OUT_changed = transmitRegisters.PORTB_OUT != _previousRegisters.PORTB_OUT || _first;
        const bool PORTA_OUT_changed = transmitRegisters.PORTA_OUT != _previousRegisters.PORTA_OUT || _first;
        const bool PORTC_DIR_changed = transmitRegisters.PORTC_DIR != _previousRegisters.PORTC_DIR || _first;
        const bool PORTB_DIR_changed = transmitRegisters.PORTB_DIR != _previousRegisters.PORTB_DIR || _first;
        const bool PORTA_DIR_changed = transmitRegisters.PORTA_DIR != _previousRegisters.PORTA_DIR || _first;
        const bool AC_CTRLA_changed = transmitRegisters.AC_CTRLA != _previousRegisters.AC_CTRLA || _first;
        const bool AC_MUXCTRLA_changed = transmitRegisters.AC_MUXCTRLA != _previousRegisters.AC_MUXCTRLA || _first;
        const bool AC_DACREF_changed = transmitRegisters.AC_DACREF != _previousRegisters.AC_DACREF || _first;

		const bool PORTMUX_EVSYSROUTEA_changed = transmitRegisters.PORTMUX_EVSYSROUTEA != _previousRegisters.PORTMUX_EVSYSROUTEA || _first;
		const bool PORTMUX_CCLROUTEA_changed = transmitRegisters.PORTMUX_CCLROUTEA != _previousRegisters.PORTMUX_CCLROUTEA || _first;
        const bool EVSYS_CHANNEL_changed =  transmitRegisters.EVSYS_CHANNEL[0] != _previousRegisters.EVSYS_CHANNEL[0] ||
                                            transmitRegisters.EVSYS_CHANNEL[1] != _previousRegisters.EVSYS_CHANNEL[1] ||
                                            transmitRegisters.EVSYS_CHANNEL[2] != _previousRegisters.EVSYS_CHANNEL[2] ||
                                            transmitRegisters.EVSYS_CHANNEL[3] != _previousRegisters.EVSYS_CHANNEL[3] ||
                                            transmitRegisters.EVSYS_CHANNEL[4] != _previousRegisters.EVSYS_CHANNEL[4] ||
                                            transmitRegisters.EVSYS_CHANNEL[5] != _previousRegisters.EVSYS_CHANNEL[5] ||
                                            _first;

