FL0WL0W/EmbeddedIOServices/HardwareAbstractions/ATTiny427Expander/src/ATTiny427ExpanderUpdateService.cpp
        const bool EVSYS_USER_changed = transmitRegisters.EVSYS_CCL_LUT0A != _previousRegisters.EVSYS_CCL_LUT0A ||
                                        transmitRegisters.EVSYS_CCL_LUT1A != _previousRegisters.EVSYS_CCL_LUT1A ||
                                        transmitRegisters.EVSYS_CCL_LUT2A != _previousRegisters.EVSYS_CCL_LUT2A ||
                                        transmitRegisters.EVSYS_CCL_LUT3A != _previousRegisters.EVSYS_CCL_LUT3A ||
                                        transmitRegisters.EVSYS_EVOUTA != _previousRegisters.EVSYS_EVOUTA ||
                                        transmitRegisters.EVSYS_EVOUTB != _previousRegisters.EVSYS_EVOUTB ||
                                        transmitRegisters.EVSYS_EVOUTC != _previousRegisters.EVSYS_EVOUTC ||
                                        _first;
                                            
        const bool EVSYS_TCB0_changed = transmitRegisters.EVSYS_TCB0_CAPT != _previousRegisters.EVSYS_TCB0_CAPT || _first;
        const bool EVSYS_TCB1_changed = transmitRegisters.EVSYS_TCB1_CAPT != _previousRegisters.EVSYS_TCB1_CAPT || _first;

        const bool CCL_CTRLA_changed = transmitRegisters.CCL_CTRLA != _previousRegisters.CCL_CTRLA || _first;

        const bool CCL_LUT0_changed =   transmitRegisters.CCL_LUT0CTRLA != _previousRegisters.CCL_LUT0CTRLA ||
                                        transmitRegisters.CCL_LUT0CTRLB != _previousRegisters.CCL_LUT0CTRLB ||
                                        transmitRegisters.CCL_LUT0CTRLC != _previousRegisters.CCL_LUT0CTRLC ||
                                        transmitRegisters.CCL_LUT0TRUTH != _previousRegisters.CCL_LUT0TRUTH ||
                                        _first;
        const bool CCL_LUT1_changed =   transmitRegisters.CCL_LUT1CTRLA != _previousRegisters.CCL_LUT1CTRLA ||
                                        transmitRegisters.CCL_LUT1CTRLB != _previousRegisters.CCL_LUT1CTRLB ||
                                        transmitRegisters.CCL_LUT1CTRLC != _previousRegisters.CCL_LUT1CTRLC ||
                                        transmitRegisters.CCL_LUT1TRUTH != _previousRegisters.CCL_LUT1TRUTH ||
                                        _first;
        const bool CCL_LUT2_changed =   transmitRegisters.CCL_LUT2CTRLA != _previousRegisters.CCL_LUT2CTRLA ||
                                        transmitRegisters.CCL_LUT2CTRLB != _previousRegisters.CCL_LUT2CTRLB ||
                                        transmitRegisters.CCL_LUT2CTRLC != _previousRegisters.CCL_LUT2CTRLC ||
                                        transmitRegisters.CCL_LUT2TRUTH != _previousRegisters.CCL_LUT2TRUTH ||
                                        _first;
        const bool CCL_LUT3_changed =   transmitRegisters.CCL_LUT3CTRLA != _previousRegisters.CCL_LUT3CTRLA ||
                                        transmitRegisters.CCL_LUT3CTRLB != _previousRegisters.CCL_LUT3CTRLB ||
                                        transmitRegisters.CCL_LUT3CTRLC != _previousRegisters.CCL_LUT3CTRLC ||
                                        transmitRegisters.CCL_LUT3TRUTH != _previousRegisters.CCL_LUT3TRUTH ||
                                        _first;
        const bool TCA_CTRLA_changed = transmitRegisters.TCA_CTRLA != _previousRegisters.TCA_CTRLA || _first;
        const bool TCA_CTRLB_changed = transmitRegisters.TCA_CTRLB != _previousRegisters.TCA_CTRLB || _first;
        const bool TCA_CTRLC_changed = transmitRegisters.TCA_CTRLC != _previousRegisters.TCA_CTRLC || _first;
        const bool TCA_CTRLD_changed = transmitRegisters.TCA_CTRLD != _previousRegisters.TCA_CTRLD || _first;
        const bool TCA_PERBUF_changed = transmitRegisters.TCA_PERBUF != _previousRegisters.TCA_PERBUF || _first;
        const bool TCA_CMP0BUF_changed = transmitRegisters.TCA_CMP0BUF != _previousRegisters.TCA_CMP0BUF || _first;
        const bool TCA_CMP1BUF_changed = transmitRegisters.TCA_CMP1BUF != _previousRegisters.TCA_CMP1BUF || _first;
        const bool TCA_CMP2BUF_changed = transmitRegisters.TCA_CMP2BUF != _previousRegisters.TCA_CMP2BUF || _first;

        uint16_t dataIndex = 0;
        uint16_t currentReadFinishedIndex = 0;
        int8_t state = 0;
        bool writeGPIOR = false;
        bool readGPIO = false;
        bool readTCB = false;

        while(state != -1)
        {
            if(writeGPIOR && currentReadFinishedIndex <= dataIndex)
            {
                if(GPIOR0_changed)
                {
                    data[dataIndex++] = 0xE3;
                    data[dataIndex++] = 0x1C;
                    data[dataIndex++] = transmitRegisters.GPIOR0;
                    data[dataIndex++] = transmitRegisters.GPIOR1;
                    data[dataIndex++] = transmitRegisters.GPIOR2 | 0x80;
                }
                else if(GPIOR1_changed)
                {
                    data[dataIndex++] = 0xE2;
                    data[dataIndex++] = 0x1D;
                    data[dataIndex++] = transmitRegisters.GPIOR1;
                    data[dataIndex++] = transmitRegisters.GPIOR2 | 0x80;
                }
                else if(GPIOR2_changed || resetAccumulate)
                {
                    data[dataIndex++] = 0xE1;
                    data[dataIndex++] = 0x1E;
                    data[dataIndex++] = transmitRegisters.GPIOR2 | (resetAccumulate? 0x80 : 0x00);
                }

                if(analogStart)
                {
                    data[dataIndex++] = 0x85; //write 16bit address
                    data[dataIndex++] = 0x06; //address high
                    data[dataIndex++] = 0x00; //address low
                    data[dataIndex++] = 0b00100001; //enable ADC with low latency
                    data[dataIndex++] = 0x01; //prescaler DIV4 to get ADCCLK 5MHZ
                    data[dataIndex++] = 0xA0; //set timebase and VDD reference
                    data[dataIndex++] = 0x00; //no window source mode
                    data[dataIndex++] = 0x01; //enable RESRDY interrupt
                    data[dataIndex++] = 0xC3; //write 3 bytes to 8 bit address using existing high byte
                    data[dataIndex++] = 0x08; //address low
                    data[dataIndex++] = 0x05; //SAMPDUR = 5. TODO add this as an adjustable parameter from analogservice
                    data[dataIndex++] = 0x00; //co accumulation. accumulation done in software so the readings are evenly spaced
                    data[dataIndex++] = 0x11; //single 12 bit mode and start
                    _analogRunning = true;
                }

