FL0WL0W/EmbeddedIOServices/HardwareAbstractions/ATTiny427Expander/src/ATTiny427ExpanderUpdateService.cpp
                writeGPIOR = false;
            }
            if(readGPIO && currentReadFinishedIndex <= dataIndex)
            {
                data[dataIndex++] = 0x61; //read 1 byte from 8 bit address with 0 as high address byte
                data[dataIndex++] = 0x0A; //address
                data[dataIndex++] = 0x61; //read 1 byte from 8 bit address with 0 as high address byte
                data[dataIndex++] = 0x06; //address
                data[dataIndex++] = 0x61; //read 1 byte from 8 bit address with 0 as high address byte
                data[dataIndex++] = 0x02; //address
                currentReadFinishedIndex = dataIndex + 1;
                readGPIO = false;
            }
            if(readTCB && currentReadFinishedIndex <= dataIndex)
            {

            }

            switch(state)
            {
                case 0:
                    writeGPIOR = true;
                    if(_previousRegisters.AnalogEnable != 0 && _analogRunning)
                    {
                        //count number of analog channels
                        uint8_t analogChannelCount = 0;
                        if(_previousRegisters.AnalogEnable & 0b0000000000000010)
                            analogChannelCount++;
                        if(_previousRegisters.AnalogEnable & 0b0000000000000100)
                            analogChannelCount++;
                        if(_previousRegisters.AnalogEnable & 0b0000000000001000)
                            analogChannelCount++;
                        if(_previousRegisters.AnalogEnable & 0b0000000000010000)
                            analogChannelCount++;
                        if(_previousRegisters.AnalogEnable & 0b0001000000000000)
                            analogChannelCount++;
                        if(_previousRegisters.AnalogEnable & 0b0010000000000000)
                            analogChannelCount++;
                        if(_previousRegisters.AnalogEnable & 0b0100000000000000)
                            analogChannelCount++;
                        if(_previousRegisters.AnalogEnable & 0b1000000000000000)
                            analogChannelCount++;
                        if(_previousRegisters.AnalogEnable & 0b0000000000100000)
                            analogChannelCount++;
                        if(_previousRegisters.AnalogEnable & 0b0000000001000000)
                            analogChannelCount++;
                        if(_previousRegisters.AnalogEnable & 0b0000000010000000)
                            analogChannelCount++;
                        if(_previousRegisters.AnalogEnable & 0b0000000100000000)
                            analogChannelCount++;
                        if(_previousRegisters.AnalogEnable & 0b0000001000000000)
                            analogChannelCount++;
                        if(_previousRegisters.AnalogEnable & 0b0000010000000000)
                            analogChannelCount++;
                        if(_previousRegisters.AnalogEnable & 0b0000100000000000)
                            analogChannelCount++;

                        //read AnalogEnable register 
                        data[dataIndex++] = 0x62;
                        data[dataIndex++] = 0x1C;

                        //then read analog values
                        if(analogChannelCount > 14)
                            data[dataIndex++] = analogChannelCount;
                        else if(analogChannelCount > 7)
                            data[dataIndex++] = analogChannelCount + 1;
                        else
                            data[dataIndex++] = analogChannelCount * 2 + 1;
                        data[dataIndex++] = 0x34;
                        data[dataIndex++] = 0x0D;

                        currentReadFinishedIndex = dataIndex + analogChannelCount * 2 + 1;

                        //if a big read, do follow on read command
                        if(analogChannelCount > 14)
                        {
                            data[dataIndex++] = 0x10 | analogChannelCount;
                            data[dataIndex++] = 0x11;
                        }
                        else if(analogChannelCount > 7)
                        {
                            data[dataIndex++] = 0x10 | analogChannelCount;
                        }
                    }
                    state++;
                    break;
                case 1:
                    if(analogStop)
                    {
                        //todo stop analog
                    }
                    state++;
                    break;
                case 2:
                    if(PORTC_OUT_changed)
                    {
                        data[dataIndex++] = 0xE1; //write 1 byte to 8 bit address with 0 as high address byte
                        data[dataIndex++] = 0x09; //address
                        data[dataIndex++] = transmitRegisters.PORTC_OUT; //OUT
                    }
                    state++;
                    break;
                case 3:
                    if(PORTC_PINCTRL_changed) // this probably needs to be conditional set before DIR change to output, and after DIR change to input. same with EVSYS output change
                    {
                        data[dataIndex++] = 0x86; //write 6 bytes to 16bit address
                        data[dataIndex++] = 0x04; //address high
                        data[dataIndex++] = 0x50; //address low
                        data[dataIndex++] = transmitRegisters.PORTC_PINCTRL[0];
                        data[dataIndex++] = transmitRegisters.PORTC_PINCTRL[1];
                        data[dataIndex++] = transmitRegisters.PORTC_PINCTRL[2];
                        data[dataIndex++] = transmitRegisters.PORTC_PINCTRL[3];
                        data[dataIndex++] = transmitRegisters.PORTC_PINCTRL[4];
                        data[dataIndex++] = transmitRegisters.PORTC_PINCTRL[5];
                    }
                    state++;
                    break;
                case 4:
                    if(PORTB_OUT_changed)
                    {
                        data[dataIndex++] = PORTC_DIR_changed? 0xE3 : 0xE1; //write 1 or 3 bytes to 8 bit address with 0 as high address byte
                        data[dataIndex++] = 0x05; //address
                        data[dataIndex++] = transmitRegisters.PORTB_OUT; //OUT
                        if(PORTC_DIR_changed)
                        {
                            data[dataIndex++] = 0; //INTFlags. writing 0 to this does nothing
                            data[dataIndex++] = transmitRegisters.PORTC_DIR; //DIR
                        }
                    }
                    state++;
                    break;
                case 5:
                    if(PORTB_PINCTRL_changed) // this probably needs to be conditional set before DIR change to output, and after DIR change to input. same with EVSYS output change
                    {
                        data[dataIndex++] = 0x88; //write 8 bytes to 16bit address
                        data[dataIndex++] = 0x04; //address high
                        data[dataIndex++] = 0x30; //address low
                        data[dataIndex++] = transmitRegisters.PORTB_PINCTRL[0];
                        data[dataIndex++] = transmitRegisters.PORTB_PINCTRL[1];
                        data[dataIndex++] = transmitRegisters.PORTB_PINCTRL[2];
                        data[dataIndex++] = transmitRegisters.PORTB_PINCTRL[3];
                        data[dataIndex++] = transmitRegisters.PORTB_PINCTRL[4];
                        data[dataIndex++] = transmitRegisters.PORTB_PINCTRL[5];
                        data[dataIndex++] = transmitRegisters.PORTB_PINCTRL[6];
                        data[dataIndex++] = transmitRegisters.PORTB_PINCTRL[7];
                    }
                    state++;
                    break;
                case 6:
                    if(PORTA_OUT_changed)
                    {
                        data[dataIndex++] = PORTB_DIR_changed? 0xE3 : 0xE1; //write 1 or 3 bytes to 8 bit address with 0 as high address byte
                        data[dataIndex++] = 0x01; //address
                        data[dataIndex++] = transmitRegisters.PORTA_OUT; //OUT
                        if(PORTB_DIR_changed)
                        {
                            data[dataIndex++] = 0; //INTFlags. writing 0 to this does nothing
                            data[dataIndex++] = transmitRegisters.PORTB_DIR; //DIR
                        }
                    }
                    state++;
                    break;
                case 7:
                    if(PORTA_PINCTRL_changed) // this probably needs to be conditional set before DIR change to output, and after DIR change to input. same with EVSYS output change
                    {
                        data[dataIndex++] = 0x88; //write 8 bytes to 16bit address
                        data[dataIndex++] = 0x04; //address high
                        data[dataIndex++] = 0x10; //address low
                        data[dataIndex++] = transmitRegisters.PORTA_PINCTRL[0];
                        data[dataIndex++] = transmitRegisters.PORTA_PINCTRL[1];
                        data[dataIndex++] = transmitRegisters.PORTA_PINCTRL[2];
                        data[dataIndex++] = transmitRegisters.PORTA_PINCTRL[3];
                        data[dataIndex++] = transmitRegisters.PORTA_PINCTRL[4];
                        data[dataIndex++] = transmitRegisters.PORTA_PINCTRL[5];
                        data[dataIndex++] = transmitRegisters.PORTA_PINCTRL[6];
                        data[dataIndex++] = transmitRegisters.PORTA_PINCTRL[7];
                    }
                    state++;
                    break;
                case 8:
                    if(PORTC_DIR_changed && !PORTB_OUT_changed)
                    {
                        data[dataIndex++] = 0xE1; //write 1 byte to 8 bit address with 0 as high address byte
                        data[dataIndex++] = 0x08; //address
                        data[dataIndex++] = transmitRegisters.PORTC_DIR; //DIR
                    }
                    state++;
                    break;
                case 9:
                    if(PORTB_DIR_changed && !PORTA_OUT_changed)
                    {
                        data[dataIndex++] = 0xE1; //write 1 byte to 8 bit address with 0 as high address byte
                        data[dataIndex++] = 0x04; //address
                        data[dataIndex++] = transmitRegisters.PORTB_DIR; //DIR
                    }
                    state++;
                    break;
                case 10:
                    if(PORTA_DIR_changed)
                    {
                        data[dataIndex++] = 0xE1; //write 1 byte to 8 bit address with 0 as high address byte
                        data[dataIndex++] = 0x00; //address
                        data[dataIndex++] = transmitRegisters.PORTA_DIR; //DIR
                    }
                    readGPIO = true;
                    state++;
                    break;
                case 11:
                    if(AC_CTRLA_changed)
                    {
                        data[dataIndex++] = 0x81 + (AC_MUXCTRLA_changed && AC_DACREF_changed? 4 : (AC_MUXCTRLA_changed? 2 : 0)); //write 16bit address
                        data[dataIndex++] = 0x06; //address high
                        data[dataIndex++] = 0x80; //address low
                        data[dataIndex++] = transmitRegisters.AC_CTRLA; //CTRLA
                        if(AC_MUXCTRLA_changed)
                        {
                            data[dataIndex++] = 0; //nothing byte
                            data[dataIndex++] = transmitRegisters.AC_MUXCTRLA; //MUXCTRLA
                            if(AC_DACREF_changed)
                            {
                                data[dataIndex++] = 0; //nothing byte
                                data[dataIndex++] = transmitRegisters.AC_DACREF; //DACREF
                            }
                        }
                        else if(AC_DACREF_changed)
                        {
                            data[dataIndex++] = 0xC1; //write 1 byte to 8 bit address using existing high byte
                            data[dataIndex++] = 0x82; //low byte
                            data[dataIndex++] = transmitRegisters.AC_DACREF; //DACREF
                        }
                    }
                    else if(AC_MUXCTRLA_changed)
                    {
                        data[dataIndex++] = 0x81 + (AC_DACREF_changed? 2 : 0); //write 16bit address
                        data[dataIndex++] = 0x06; //address high
                        data[dataIndex++] = 0x82; //address low
                        data[dataIndex++] = transmitRegisters.AC_MUXCTRLA; //MUXCTRLA
                        if(AC_DACREF_changed)
                        {
                            data[dataIndex++] = 0; //nothing byte
                            data[dataIndex++] = transmitRegisters.AC_DACREF; //DACREF
                        }
                    }
                    else if(AC_DACREF_changed)
                    {
                        data[dataIndex++] = 0x81; //write 16bit address
                        data[dataIndex++] = 0x06; //address high
                        data[dataIndex++] = 0x84; //address low
                        data[dataIndex++] = transmitRegisters.AC_DACREF; //DACREF
                    }
                    state++;
                    break;
                case 12:
                    if(PORTMUX_EVSYSROUTEA_changed)
                    {
                        if(PORTMUX_CCLROUTEA_changed)
                        {
                            data[dataIndex++] = 0x82; //write 16bit address
                            data[dataIndex++] = 0x05; //address high
                            data[dataIndex++] = 0xE0; //address low
                            data[dataIndex++] = transmitRegisters.PORTMUX_EVSYSROUTEA; //PORTMUX_EVSYSROUTEA
                            data[dataIndex++] = transmitRegisters.PORTMUX_CCLROUTEA; //PORTMUX_CCLROUTEA
                        }
                        else
                        {
                            data[dataIndex++] = 0x81; //write 16bit address
                            data[dataIndex++] = 0x05; //address high
                            data[dataIndex++] = 0xE0; //address low
                            data[dataIndex++] = transmitRegisters.PORTMUX_EVSYSROUTEA; //PORTMUX_EVSYSROUTEA
                        }
                    }
                    else if(PORTMUX_CCLROUTEA_changed)
                    {
                        data[dataIndex++] = 0x81; //write 16bit address
                        data[dataIndex++] = 0x05; //address high
                        data[dataIndex++] = 0xE1; //address low
                        data[dataIndex++] = transmitRegisters.PORTMUX_CCLROUTEA; //PORTMUX_CCLROUTEA
                    }
                    state++;
                    break;
                case 13:
                    if(EVSYS_CHANNEL_changed)
                    {
                        data[dataIndex++] = 0x86; //write 16bit address
                        data[dataIndex++] = 0x01; //address high
                        data[dataIndex++] = 0x90; //address low
                        data[dataIndex++] = transmitRegisters.EVSYS_CHANNEL[0];
                        data[dataIndex++] = transmitRegisters.EVSYS_CHANNEL[1];
                        data[dataIndex++] = transmitRegisters.EVSYS_CHANNEL[2];
                        data[dataIndex++] = transmitRegisters.EVSYS_CHANNEL[3];
                        data[dataIndex++] = transmitRegisters.EVSYS_CHANNEL[4];
                        data[dataIndex++] = transmitRegisters.EVSYS_CHANNEL[5];
                    }
                    state++;
                    break;
                case 14:
                    if(EVSYS_USER_changed)
                    {
                        data[dataIndex++] = 0x87; //write 16bit address
                        data[dataIndex++] = 0x01; //address high
                        data[dataIndex++] = 0xA0; //address low
                        data[dataIndex++] = transmitRegisters.EVSYS_CCL_LUT0A;
                        data[dataIndex++] = 0;
                        data[dataIndex++] = transmitRegisters.EVSYS_CCL_LUT1A;
                        data[dataIndex++] = 0;
                        data[dataIndex++] = transmitRegisters.EVSYS_CCL_LUT2A;
                        data[dataIndex++] = 0;
                        data[dataIndex++] = transmitRegisters.EVSYS_CCL_LUT3A;
                        data[dataIndex++] = 0xC3;
                        data[dataIndex++] = 0xA9; //address low
                        data[dataIndex++] = transmitRegisters.EVSYS_EVOUTA;
                        data[dataIndex++] = transmitRegisters.EVSYS_EVOUTB;
                        data[dataIndex++] = transmitRegisters.EVSYS_EVOUTC;
                    }
                    state++;
                    break;
                case 15:
                    if(EVSYS_TCB0_changed)
                    {
                        if(EVSYS_TCB1_changed)
                        {
                            data[dataIndex++] = 0x83;
                            data[dataIndex++] = 0x01; //address high
                            data[dataIndex++] = 0xB0; //address low
                            data[dataIndex++] = transmitRegisters.EVSYS_TCB0_CAPT;
                            data[dataIndex++] = 0;
                            data[dataIndex++] = transmitRegisters.EVSYS_TCB1_CAPT;
                        }
                        else
                        {
                            data[dataIndex++] = 0x81;
                            data[dataIndex++] = 0x01; //address high
                            data[dataIndex++] = 0xB0; //address low
                            data[dataIndex++] = transmitRegisters.EVSYS_TCB0_CAPT;
                        }
                    }
                    else if(EVSYS_TCB1_changed)
                    {
                        data[dataIndex++] = 0x81;
                        data[dataIndex++] = 0x01; //address high
                        data[dataIndex++] = 0xB2; //address low
                        data[dataIndex++] = transmitRegisters.EVSYS_TCB1_CAPT;
                    }
                    state++;
                    break;
                case 16:
                    if(CCL_CTRLA_changed)
                    {
                        data[dataIndex++] = 0x81;
                        data[dataIndex++] = 0x01; //address high
                        data[dataIndex++] = 0xC0; //address low
                        data[dataIndex++] = transmitRegisters.CCL_CTRLA;
                    }
                    state++;
                    break;
                case 17:
                    if(CCL_LUT0_changed)
                    {
                        data[dataIndex++] = 0x83;
                        data[dataIndex++] = 0x01; //address high
                        data[dataIndex++] = 0xC9; //address low
                        data[dataIndex++] = transmitRegisters.CCL_LUT0CTRLB;
                        data[dataIndex++] = transmitRegisters.CCL_LUT0CTRLC;
                        data[dataIndex++] = transmitRegisters.CCL_LUT0TRUTH;

                        data[dataIndex++] = 0xC1;
                        data[dataIndex++] = 0xC8; //address low
                        data[dataIndex++] = transmitRegisters.CCL_LUT0CTRLA;
                    }
                    state++;
                    break;
                case 18:
                    if(CCL_LUT1_changed)
                    {
                        data[dataIndex++] = 0x83;
                        data[dataIndex++] = 0x01; //address high
                        data[dataIndex++] = 0xCD; //address low
                        data[dataIndex++] = transmitRegisters.CCL_LUT1CTRLB;
                        data[dataIndex++] = transmitRegisters.CCL_LUT1CTRLC;
                        data[dataIndex++] = transmitRegisters.CCL_LUT1TRUTH;

                        data[dataIndex++] = 0xC1;
                        data[dataIndex++] = 0xCC; //address low
                        data[dataIndex++] = transmitRegisters.CCL_LUT1CTRLA;
                    }
                    state++;
                    break;
                case 19:
                    if(CCL_LUT2_changed)
                    {
                        data[dataIndex++] = 0x83;
                        data[dataIndex++] = 0x01; //address high
                        data[dataIndex++] = 0xD1; //address low
                        data[dataIndex++] = transmitRegisters.CCL_LUT2CTRLB;
                        data[dataIndex++] = transmitRegisters.CCL_LUT2CTRLC;
                        data[dataIndex++] = transmitRegisters.CCL_LUT2TRUTH;

                        data[dataIndex++] = 0xC1;
                        data[dataIndex++] = 0xD0; //address low
                        data[dataIndex++] = transmitRegisters.CCL_LUT2CTRLA;
                    }
                    state++;
                    break;
                case 20:
                    if(CCL_LUT3_changed)
                    {
                        data[dataIndex++] = 0x83;
                        data[dataIndex++] = 0x01; //address high
                        data[dataIndex++] = 0xD5; //address low
                        data[dataIndex++] = transmitRegisters.CCL_LUT3CTRLB;
                        data[dataIndex++] = transmitRegisters.CCL_LUT3CTRLC;
                        data[dataIndex++] = transmitRegisters.CCL_LUT3TRUTH;

