FL0WL0W/EmbeddedIOServices/HardwareAbstractions/ATTiny427Expander/src/ATTiny427ExpanderUpdateService.cpp
                        data[dataIndex++] = 0xC1;
                        data[dataIndex++] = 0xD4; //address low
                        data[dataIndex++] = transmitRegisters.CCL_LUT3CTRLA;
                    }
                    state++;
                    break;
                case 21:
                    if(TCA_PERBUF_changed)
                    {
                        data[dataIndex++] = 0x82 + 
                            ((TCA_CMP2BUF_changed && (TCA_CMP1BUF_changed || TCA_CMP0BUF_changed))? 6 : 
                            (TCA_CMP1BUF_changed? 4 : (TCA_CMP0BUF_changed? 2 : 0)));
                        data[dataIndex++] = 0x0A; //address high
                        data[dataIndex++] = 0x36;
                        data[dataIndex++] = transmitRegisters.TCA_PERBUF & 0xFF;
                        data[dataIndex++] = (transmitRegisters.TCA_PERBUF >> 8) & 0xFF;
                        if(TCA_CMP2BUF_changed && (TCA_CMP1BUF_changed || TCA_CMP0BUF_changed))
                        {
                            data[dataIndex++] = transmitRegisters.TCA_CMP0BUF & 0xFF;
                            data[dataIndex++] = (transmitRegisters.TCA_CMP0BUF >> 8) & 0xFF;
                            data[dataIndex++] = transmitRegisters.TCA_CMP1BUF & 0xFF;
                            data[dataIndex++] = (transmitRegisters.TCA_CMP1BUF >> 8) & 0xFF;
                            data[dataIndex++] = transmitRegisters.TCA_CMP2BUF & 0xFF;
                            data[dataIndex++] = (transmitRegisters.TCA_CMP2BUF >> 8) & 0xFF;
                        }
                        else if(TCA_CMP1BUF_changed)
                        {
                            data[dataIndex++] = transmitRegisters.TCA_CMP0BUF & 0xFF;
                            data[dataIndex++] = (transmitRegisters.TCA_CMP0BUF >> 8) & 0xFF;
                            data[dataIndex++] = transmitRegisters.TCA_CMP1BUF & 0xFF;
                            data[dataIndex++] = (transmitRegisters.TCA_CMP1BUF >> 8) & 0xFF;
                        }
                        else if(TCA_CMP0BUF_changed)
                        {
                            data[dataIndex++] = transmitRegisters.TCA_CMP0BUF & 0xFF;
                            data[dataIndex++] = (transmitRegisters.TCA_CMP0BUF >> 8) & 0xFF;
                        }
                        else
                        {
                            data[dataIndex++] = 0xC2;
                            data[dataIndex++] = 0x3C;
                            data[dataIndex++] = transmitRegisters.TCA_CMP2BUF & 0xFF;
                            data[dataIndex++] = (transmitRegisters.TCA_CMP2BUF >> 8) & 0xFF;
                        }
                    }
                    else if(TCA_CMP0BUF_changed)
                    {
                        data[dataIndex++] = 0x82 + (TCA_CMP2BUF_changed? 4 : (TCA_CMP1BUF_changed? 2 : 0));
                        data[dataIndex++] = 0x0A; //address high
                        data[dataIndex++] = 0x38;
                        data[dataIndex++] = transmitRegisters.TCA_CMP0BUF & 0xFF;
                        data[dataIndex++] = (transmitRegisters.TCA_CMP0BUF >> 8) & 0xFF;
                        if(TCA_CMP2BUF_changed)
                        {
                            data[dataIndex++] = transmitRegisters.TCA_CMP1BUF & 0xFF;
                            data[dataIndex++] = (transmitRegisters.TCA_CMP1BUF >> 8) & 0xFF;
                            data[dataIndex++] = transmitRegisters.TCA_CMP2BUF & 0xFF;
                            data[dataIndex++] = (transmitRegisters.TCA_CMP2BUF >> 8) & 0xFF;
                        }
                        else if(TCA_CMP1BUF_changed)
                        {
                            data[dataIndex++] = transmitRegisters.TCA_CMP1BUF & 0xFF;
                            data[dataIndex++] = (transmitRegisters.TCA_CMP1BUF >> 8) & 0xFF;
                        }
                    }
                    else if(TCA_CMP1BUF_changed)
                    {
                        data[dataIndex++] = 0x82 + (TCA_CMP2BUF_changed? 2 : 0);
                        data[dataIndex++] = 0x0A; //address high
                        data[dataIndex++] = 0x3A;
                        data[dataIndex++] = transmitRegisters.TCA_CMP1BUF & 0xFF;
                        data[dataIndex++] = (transmitRegisters.TCA_CMP1BUF >> 8) & 0xFF;
                        if(TCA_CMP2BUF_changed)
                        {
                            data[dataIndex++] = transmitRegisters.TCA_CMP2BUF & 0xFF;
                            data[dataIndex++] = (transmitRegisters.TCA_CMP2BUF >> 8) & 0xFF;
                        }
                    }
                    else if(TCA_CMP2BUF_changed)
                    {
                        data[dataIndex++] = 0x82;
                        data[dataIndex++] = 0x0A; //address high
                        data[dataIndex++] = 0x3C;
                        data[dataIndex++] = transmitRegisters.TCA_CMP2BUF & 0xFF;
                        data[dataIndex++] = (transmitRegisters.TCA_CMP2BUF >> 8) & 0xFF;
                    }
                    state++;
                    break;
                case 22:
                {
                    bool highset = false;
                    if(TCA_CTRLC_changed)
                    {
                        data[dataIndex++] = 0x81 | (highset? 0x40 : 0); //write 16/8bit address
                        if(!highset)
                        {
                            data[dataIndex++] = 0x0A; //address high
                            highset = true;
                        }
                        data[dataIndex++] = 0x02;
                        data[dataIndex++] = transmitRegisters.TCA_CTRLC; //CTRLC
                    }
                    if(TCA_CTRLA_changed)
                    {
                        data[dataIndex++] = (0x81 + (TCA_CTRLB_changed? 1 : 0)) | (highset? 0x40 : 0); //write 16/8bit address
                        if(!highset)
                        {
                            data[dataIndex++] = 0x0A; //address high
                            highset = true;
                        }
                        data[dataIndex++] = 0x00; //address low
                        data[dataIndex++] = transmitRegisters.TCA_CTRLA; //CTRLA
                        if(TCA_CTRLB_changed)
                        {
                            data[dataIndex++] = transmitRegisters.TCA_CTRLB; //CTRLB
                        }
                    }
                    else if(TCA_CTRLB_changed)
                    {
                        data[dataIndex++] = 0x81 | (highset? 0x40 : 0); //write 16/8bit address
                        if(!highset)
                        {
                            data[dataIndex++] = 0x0A; //address high
                            highset = true;
                        }
                        data[dataIndex++] = 0x01; //address low
                        data[dataIndex++] = transmitRegisters.TCA_CTRLB; //CTRLB
                    }
                    state++;
                    break;
                }


                default: 
                    if(dataIndex < currentReadFinishedIndex)
                    {
                        std::memset(&data[dataIndex], 0, currentReadFinishedIndex - dataIndex);
                        dataIndex = currentReadFinishedIndex;
                    }
                    else
                    {
                        state = -1;
                    }
                break;
            }
        }

        if(dataIndex > 0 && (transmitRegisters.Comm == SPI || transmitRegisters.Comm== SPIAlternate))
        {
            std::memset(&data[dataIndex], 0, 2);
            dataIndex += 2;
        }

        _first = false;
        _previousRegisters = transmitRegisters;

        return dataIndex;
    }
}
#endif
